reference/fio_test.txt
[root@ceph1 fioconf]# fio r-0r100w-4kb.conf
write4k-rand: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.10
Starting 4 threads
Jobs: 4 (f=4): [w(4)] [4.3% done] [0KB/58212KB/0KB /s] [0/14.6K/0 iops] [eta 09m:42s]
Jobs: 4 (f=4): [w(4)] [100.0% done] [0KB/98.19MB/0KB /s] [0/25.2K/0 iops] [eta 00m:00s]
write4k-rand: (groupid=0, jobs=4): err= 0: pid=22529: Wed Aug 31 18:06:48 2016
  write: io=50657MB, bw=86451KB/s, iops=21612, runt=600030msec
    slat (usec): min=4, max=19047, avg=33.70, stdev=133.63
    clat (usec): min=36, max=873348, avg=5884.49, stdev=25027.50
     lat (usec): min=803, max=873371, avg=5918.76, stdev=25027.43
    clat percentiles (usec):
     |  1.00th=[  956],  5.00th=[ 1224], 10.00th=[ 1496], 20.00th=[ 1896],
     | 30.00th=[ 2256], 40.00th=[ 2608], 50.00th=[ 2992], 60.00th=[ 3504],
     | 70.00th=[ 4192], 80.00th=[ 5216], 90.00th=[ 7584], 95.00th=[11712],
     | 99.00th=[56576], 99.50th=[104960], 99.90th=[460800], 99.95th=[593920],
     | 99.99th=[741376]
    bw (KB  /s): min=    0, max=37136, per=25.86%, avg=22354.01, stdev=9273.10
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.02%, 500=0.06%, 750=0.05%
    lat (usec) : 1000=1.43%
    lat (msec) : 2=21.31%, 4=44.82%, 10=25.58%, 20=4.49%, 50=1.13%
    lat (msec) : 100=0.56%, 250=0.32%, 500=0.13%, 750=0.07%, 1000=0.01%
  cpu          : usr=2.71%, sys=8.32%, ctx=10224416, majf=0, minf=4856
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=101.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=12968145/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=50657MB, aggrb=86450KB/s, minb=86450KB/s, maxb=86450KB/s, mint=600030msec, maxt=600030msec

Disk stats (read/write):
  rbd0: ios=162/13200183, merge=0/0, ticks=257/74500849, in_queue=74568391, util=100.00%